Repository: AhmedZaeem/recall
Catalog: lib/l10n/arb/app_*.arb
Languages: ar, fr

source: Settings
ar: الإعدادات
fr: Paramètres

source: Dark Theme
ar: الوضع الليلي
fr: Thème sombre

source: Language
ar: اللغة
fr: Langue

source: Flashcards
ar: بطاقات تعليمية
fr: Fiches

source: Quizzes
ar: اختبارات
fr: Quiz

# policies
source: Privacy policies
ar: سياسات الخصوصية
fr: Politiques

# contactUs
source: Contact us for feedback
ar: اتصل بنا
fr: Contactez-nous

# deleteAppData
source: Clear app data
ar: حذف بيانات التطبيق
fr: Supprimer les données de l'application

source: Edit
ar: تعديل
fr: Modifier

source: Delete
ar: حذف
fr: Supprimer

source: Cancel
ar: إلغاء
fr: Annuler

source: Save
ar: حفظ
fr: Enregistrer

source: Edit Deck
ar: تعديل المجموعة
fr: Modifier le paquet

source: Delete Deck
ar: حذف المجموعة
fr: Supprimer le paquet

source: Add Deck
ar: إضافة مجموعة
fr: Ajouter un paquet

source: Deck Name
ar: اسم المجموعة
fr: Nom du paquet

source: Deck Description
ar: وصف المجموعة
fr: Description du paquet

# yay
source: Yay! Your deck has been saved!
ar: مرحى! لقد قمت بإضافة مجموعة جديدة
fr: Super! Votre paquet a été enregistré!

# edited
source: Deck has been edited successfully!
ar: تم تعديل المجموعة بنجاح
fr: Le paquet a été modifié avec succès!

# problem
source: Seems like there was an issue
ar: حدثت مشكلة
fr: Il semble y avoir un problème

# deckDeleteConfirmation
source: Are you sure you want to delete this deck?
ar: هل أنت متأكد من أنك تريد حذف هذه المجموعة؟
fr: Êtes-vous sûr de vouloir supprimer ce paquet?

# deckDeleted
source: Deck has been deleted
ar: تم حذف المجموعة بنجاح
fr: Le paquet a été supprimé

source: Oops
ar: عذراً
fr: Oups

source: Update
ar: تحديث
fr: Mettre à jour

# addCard
source: Add a new flashcard
ar: إضافة بطاقة تعليمية
fr: Ajouter une nouvelle fiche

source: Term
ar: المصطلح
fr: Terme

source: Definition
ar: التعريف
fr: Définition

# yayFlashcard
source: Yay! Your flashcard has been saved!
ar: مرحى! لقد قمت بإضافة بطاقة تعليمية جديدة
fr: Super! Votre fiche a été enregistrée!

# editedFlashcard
source: Flashcard has been edited successfully!
ar: تم تعديل البطاقة التعليمية بنجاح
fr: La fiche a été modifiée avec succès!

# flashcardDeleteConfirmation
source: are you sure you want to delete this flashcard?
ar: هل أنت متأكد من أنك تريد حذف هذه البطاقة التعليمية؟
fr: Êtes-vous sûr de vouloir supprimer cette fiche?

# flashcardDeleted
source: Flashcard has been deleted
ar: تم حذف البطاقة التعليمية بنجاح
fr: La fiche a été supprimée

source: Edit Flashcard
ar: تعديل البطاقة التعليمية
fr: Modifier la fiche

source: Delete Flashcard
ar: حذف البطاقة التعليمية
fr: Supprimer la fiche

# confirmAppDataDelete
source: Are you sure you want to clear all app data?
ar: هل أنت متأكد من أنك تريد حذف جميع بيانات التطبيق؟
fr: Êtes-vous sûr de vouloir supprimer toutes les données de l'application?

# noDecks
source: No decks available yet
ar: لا توجد مجموعات بعد
fr: Vous n'avez pas encore de paquets

# noExams
source: No exams available yet
ar: لا توجد اختبارات بعد
fr: Vous n'avez pas encore de quiz
